[
{"text":"Pisces","details":"Pisces is the twelfth sign of the zodiac, and it is also the final sign in the zodiacal cycle. Hence, this sign brings together many of the characteristics of the eleven signs that have come before it. Pisces, however, are happiest keeping many of these qualities under wraps. These folks are selfless, spiritual and very focused on their inner journey. They also place great weight on what they are feeling. Yes, feelings define Pisces, and it's not uncommon for them to feel their own burdens (and joys) as well as those of others. The intuition of the Pisces-born is highly evolved. Many people associate Pisces with dreams and secrets, and it's a fair association, since those born under this sign feel comfortable in an illusory world.

It's a pair of Fish that represents Pisces, a symbol that prompts others to suggest that these people 'go with the flow' and 'don't make waves.' Both of these labels are true, since Pisces are fluid and easy-going, in keeping with the Mutable Quality assigned to this sign. The fact that two fish (as opposed to one) represent the members of this sign also speaks to the duality of Pisces, their yin and yang sensibility. The Fish are happy to be considered hazy, since there's a certain sense of safety in that self-proclaimed netherworld. That said, they won't stay away for long, since one of their primary goals is to help others. It's this kind of self-sacrifice that keeps these folks going. The flip side to their giving natures is that the oft-timid Fish are likely to be taken advantage of by less well-meaning souls.

Pisces is ruled by Jupiter and Neptune. In ancient Roman mythology, Jupiter (the original ruler of Pisces) was the king of the gods, while Neptune was the ruler of the seas. When Neptune was discovered in recent times, it was attached to this sign. The pairing of these two heavenly bodies results in some unique energies being directed toward Pisces here on Earth. Those born under this sign are spiritually oriented and charitable. They are compassionate, easily feeling another's pain.

The Element associated with Pisces is Water. Those born under this sign easily relate to the emotional and unpredictable nature of this liquid gold. Pisces feel a great deal, and they also feel misunderstood much of the time. They're not quite pushovers, but they're certainly sensitive. Yes, they could cry you a river if the circumstances were right. Even so, they revel in their compassionate and imaginative natures and love to cater to others. They can also be quite romantic, dreaming up delicious treats for their lover.

More relaxation for the Fish comes in the way of sports, specifically water sports. Pisces loves to swim, and it's this easy glide in a pool or the sea that serves to alleviate much of their stress. Once their mind is at ease, the Fish should focus on their feet, a frequent source of discomfort. Soothing comfort comes in a world colored in purple and soft white. When it comes to the game of love, Pisces are caring and romantic and a most creative mate.

The great strength of the Pisces-born is their compassionate and charitable nature. These folks love to help others and do so in the most imaginative of ways. It's their feeling sensibility that wins people over.","thumb":"asset:///images/thumb/Pisces.jpg","image":"asset:///images/details/Pisces.jpg"},
{"text":"Aquarius","details":"Aquarius is the eleventh sign of the zodiac, and Aquarians are the perfect representatives for the Age of Aquarius. Those born under this sign have the social conscience needed to carry us into the new millennium. These folks are humanitarian, philanthropic and keenly interested in making the world a better place. Along those lines, they'd like to make the world work better, which is why they focus much of their energy on our social institutions and how they work (or don't work). Aquarians are visionaries, progressive souls who love to spend time thinking about how things can be better. They are also quick to engage others in this process, which is why they have so many friends and acquaintances. Making the world a better place is a collaborative effort for Aquarians.

Aquarius is symbolized by the Water Bearer. In much the same way that the Water Bearer brings that precious liquid as a gift, Aquarians shower the world with their thoughts and new ideas. Luckily for Aquarians (and the rest of us), they are at a near-genius level, so their minds churn out some amazing things. Their thought process is also inventive and original. While Aquarians are happy to bestow these ideas as a gift with no strings attached, they are much happier when the rest of the world agrees with them. Naysayers will quickly find out that Aquarians can be impatient, even temperamental, with those who disagree. Yes, these folks can be quite fixed in their opinions, in keeping with the Fixed Quality assigned to this sign.

Aquarius is ruled by Saturn and Uranus. Powerful Saturn was considered the father of many gods in ancient Roman times, and was the original ruler of Aquarius.

The element associated with Aquarius is Air, and that means the rarefied air of the intellectual. Aquarians will accomplish much with their broad and logical minds, entertaining complex and scientific ideas for the betterment of all. That said, they are also artistic and inventive. It's all in the spirit of creating a better world, hopefully one in keeping with their broad-minded beliefs. Aquarians believe that their offbeat, original approach will win the day, and that new thought is what is needed to change the world. Those born under this sign are altruistic, humane people who are determined to make a difference.

At play, Aquarians like to surround themselves with lots of people, preferably family and friends. That said, if they don't know the 'players,' they soon will! Baseball and tennis are fun for these folks (though they should watch for weak ankles), and a daily swim would also be nice.

The great strengths of the Aquarius-born are their vision, intellect and humanity. They are determined to make the world a better place and to help everyone they can along the way. They are truly the trailblazers of the zodiac.","thumb":"asset:///images/thumb/Aquarius.jpg","image":"asset:///images/details/Aquarius.jpg"},
{"text":"Capricorn","details":"Capricorn, the tenth sign of the zodiac, is all about hard work. Those born under this sign are more than happy to put in a full day at the office, realizing that it will likely take a lot of those days to get to the top. That's no problem, since Capricorns are both ambitious and determined: they will get there. Life is one big project for these folks, and they adapt to this by adopting a businesslike approach to most everything they do. Capricorns are practical as well, taking things one step at a time and being as realistic and pragmatic as possible. The Capricorn-born are extremely dedicated to their goals, almost to the point of stubbornness. Those victories sure smell sweet, though, and that thought alone will keep Capricorns going.

The Goat symbolizes Capricorns, and an apt mascot it is. Goats love to climb to the top of the mountain, where the air is clear and fresh. In much the same way, Capricorns want to get to the top of their chosen field so that they can reap the benefits of success; namely fame, prestige and money. Getting to the top isn't always a walk in the park, however, so it's likely that Goats will ruffle a few feathers along the way.

Capricorn is ruled by Saturn. In ancient Roman mythology, Saturn was the father of many of the gods. Consider him top dog, if you will, and then you'll see a parallel to Capricorns. Those born under this sign also want to be the top dog, and they're smart enough to know that the title won't simply be handed to them.

With any kind of luck (make that considerable work), Caps will find themselves on that top step, but they should also remember those who have helped them on their quest. They are traditional (but not quite the button-down stiffs some would suggest) and somewhat inhibited, prompting others to wonder if they can ever enjoy success and its rarefied air. Rest assured, these folks will be smiling inside.

The element associated with Capricorn is Earth. No big surprise there! Caps are down-to-earth in the sense that they're not interested in wild ideas or round-the-world dreams. They would much rather stay put and get to work. Remember, these are the businesspeople of the zodiac, so in their sensible and economical way, they'll get up every morning and see to it that their job is done to the highest degree of quality possible.

A Capricorn at rest (yes, there is such a thing) enjoys leisurely sports, like golf and croquet so long as they have a chance to win! Playing with a crew is also nice, since it brings to mind their beloved workplace. Team colors for a Capricorn are likely to be earthy brown and khaki, much like the classic, relaxed slacks they like to wear. Sporty Caps also need to watch their teeth and knees, and they shouldn't be too daring, lest they break some bones. When it comes to love, Capricorns are ever devoted and never emotive.

The great strengths of the Capricorn-born are their willingness to work hard and their determination to succeed. Their ambition is boundless, yet they are cautious, responsible and always play fair. That's why their successes are all the more sweet.","thumb":"asset:///images/thumb/Capricorn.jpg","image":"asset:///images/details/Capricorn.jpg"},
{"text":"Sagittarius","details":"Sagittarius, the ninth sign of the zodiac, is the home of the wanderers of the zodiac. It's not a mindless ramble for these folks, either. Sagittarians are truth-seekers, and the best way for them to do this is to hit the road, talk to others and get some answers. Knowledge is key to these folks, since it fuels their broad-minded approach to life. The Sagittarian-born are keenly interested in philosophy and religion, and they find that these disciplines aid their internal quest. At the end of the day, what Sagittarius wants most is to know the meaning of life, and to accomplish this while feeling free and easy.

It's the Archer that represents Sagittarians, although in this case it's a Centaur (half man, half beast) that is flinging the arrows. Centaurs were the intellectuals of ancient Roman mythology, and Sagittarians are quick to consider themselves their modern-day counterparts. Those born under this sign are clear thinkers, and choose to look at the big picture most of the time. They also like it when others agree with their well-thought-out point of view. The alternative to this, for better or for worse, is a Sag who can become argumentative and blunt. That's not to say that these folks are intransigent Archers will listen to what others have to say, in keeping with the Mutable Quality assigned to them. Indeed, Sagittarians are enthusiastic consumers of information (and enthusiastic in general), the better to get the answers they need. It's also a good idea to give Sags lots of room to explore their world. Once these folks start to feel hemmed in, they'll become impatient and difficult.

Sagittarius is ruled by Jupiter. In ancient Roman times, Jupiter was the King of the Gods, and most Sagittarians would say that the royal pedigree has been passed on to them. The Sag-born are generous and just much like a noble leader. These folks are also expansive in their thoughts, as well as in their approach.

The Element associated with Sagittarius is Fire. Just as a fire can move quickly and uncontrollably, so can Sagittarius as they flit from one thing to the next, never looking back. For the Sag-born, it's all about action and adventure (and, hopefully, conclusions). These folks love their physicality and are often athletic, and certainly full of stamina. Life for these folks is played full-on, which is why it's chock-full of experiences.

The athleticism of Sags lends itself to challenging sports, and they definitely know they're up to the task. That's why you're likely to find them in an around-the-world solo boat race or climbing up the highest peaks (where they should be mindful of their legs and hips). No stretch is too big for a Sag, if only because these folks know they're ready (and lucky to boot). Mental games such as chess or debate also fuel the Sag's mood. Moody colors they'll wear, since they favor rich maroon and navy hues. When it comes to love games, the Archer is playful, flirtatious and always on top.

The great strength of the Sagittarius-born is their philosophical, wide-open and curious nature. These folks seek both knowledge and truth, and they are eager to share their explorations with others. Their optimistic and generous spirit makes them a pleasure to have around.","thumb":"asset:///images/thumb/Sagittarius.jpg","image":"asset:///images/details/Sagittarius.jpg"},
{"text":"Scorpio","details":"Scorpio is the eighth sign of the zodiac, and that shouldn't be taken lightly -- nor should Scorpios! Those born under this sign are dead serious in their mission to learn about others. There's no fluff or chatter for Scorpios, either; these folks will zero in on the essential questions, gleaning the secrets that lie within. Scorpios concern themselves with beginnings and endings, and are unafraid of either; they also travel in a world that is black and white and has little use for gray. The curiosity of Scorpios is immeasurable, which may be why they are such adept investigators. These folks love to probe and know how to get to the bottom of things. The fact that they have a keen sense of intuition certainly helps.

The Scorpion symbolizes Scorpio, and that is no accident. Much like the Scorpion would rather kill itself than be killed, those born under this sign are in ultimate control of their destiny. Scorpios work as hard as they do so they can someday sit back and feel satisfied with themselves. These folks are intense, passionate and filled with desire. They're also complex and secretive, so don't expect to get much out of them, lest they become suspicious and exit stage left. It's best not to bet against Scorpios, either, since these folks are surprisingly resourceful.

Scorpio is ruled by Mars and Pluto. Mars was the God of War in ancient Roman mythology and is the first (and most ancient) ruler of Scorpio. When Pluto was discovered in the 20th century, it was also assigned to this sign. Pluto was known as the God of the Underworld in ancient Roman times, so when coupled with Mars, expect some intense energy to head toward Scorpions here on Earth. This planetary combo makes for people who are motivated, penetrating and aware.

The Element associated with Scorpio is Water. As opposed to the 'roiling seas' seen in other Water Signs, a better motto for Scorpios would be 'still waters run deep.' Those born under this sign are as emotional as their waterborne brethren, it's just that they're not as likely to show it. The Scorpio's emotions are repressed, kept under cover. Again, these are secrets to be used another day. That said, be aware that these folks are clever, perceptive and always in the mix. Their ability to see into things can sometimes be a curse for Scorpios, however, since they can take an insignificant matter and turn it into a huge slight.

Scorpios love competition in both work and play, which is why they'll air it out in sports and games. Extreme sports are right up Scorpio's alley, as is most anything that will test their mettle. They've got to have an adversary, since it makes the game that much more fun. Scorpio's colors? Powerful red and serious black. When it comes to love, though, Scorpios soften up a bit and are caring and devoted with their lovers, even if they do hold on a bit tight. Scorpios are also lusty in the extreme (how else?), so they need to be mindful of their reproductive organs.

The great strength of the Scorpio-born is in their determination, passion and motivation. Scorpios don't know the word quit, which is why they usually get the job done. A powerhouse? Like no other.","thumb":"asset:///images/thumb/Scorpio.jpg","image":"asset:///images/details/Scorpio.jpg"},
{"text":"Libra","details":"Libra is the seventh sign of the zodiac, and it is at this point in the zodiac that we start to see a shift. While the first six signs of the zodiac focus on the individual, the last six focus on the individual's contact with others and with the world. Libras are first and foremost focused on others and how they relate to them. We can call this the sign of Partnership with a capital 'P' because these folks do not want to be alone! For a Libra, everything is better if it's done as a pair. Libras are good when paired up, too, since they epitomize balance, harmony and a sense of fair play. While they are true team players at work, their favorite partnership is at home: marriage. Libras feel most complete when they are coupled up with their lover, forever.

It's the Scales that symbolize Libra, and just like that balancing mechanism wants to stay even, Libras want to be on an even keel. Think of the Scales of Justice and how they work at striking the right balance. Likewise, Libras are objective, just and want to do what's best for everyone. It's possible, though, that this penchant for fairness is for a different reason: Libras abhor conflict. If that's what it takes to avoid a confrontation, that's fine with the Scales. The Libra-born are keen strategists, organizing groups with poise and getting the job done (in keeping with the Cardinal Quality assigned to this sign). Further, you can expect the Scales to be companionable, sociable folks.

Libra is ruled by Venus. In ancient Roman mythology, Venus was a smooth seductress who was at her best amid pleasurable excess. Well, Libras are certainly carrying the torch for her today. Those born under this sign always have the right thing to say and know how to make others feel comfortable. Suave? You bet. Libras are so adept at charming conversation that they need to be mindful of overstepping their boundaries and appearing vain or gossipy (the Scales do love intrigue). When these folks are on their game, however, they are a pleasure to be with.

The element associated with Libra is Air, and that means reaching higher, specifically to the higher mind. Libras like to put their mind to good use, and enjoy communicating their thoughts to others. They like to use their smarts (and talk) to get to know others better yes, knowledge about people is where it's at for Libras. You can expect the Scales to make a fair argument, too, since they live by the principles of diplomacy and compromise. When this approach doesn't work, however, Libras are not above using their persuasive charms to get their way.

Libras at play may not be as energized as at work, if you call socializing work (and the Scales do). That's why exercise for Libras needs to have a social component to it, such as that found at a gym. Alternatively, Libras love the outdoors, so riding and biking can also prove fun. They also love the colors of the sunset sky, that melding of ivory, pink and light blue. In the game of love, Libras are a bundle of energy, romantic and loyal to the core. The Scales need to be on the lookout for their lower backs, though, which tend to shoulder any burdens they may be carrying.

The great strength of the Libra-born is their quest for fairness, peace and harmony. That the Scales are the great diplomats of the zodiac further helps their case. A beautiful journey this will be, thanks to the Libra's inimitable sense of style.","thumb":"asset:///images/thumb/Libra.jpg","image":"asset:///images/details/Libra.jpg"},
{"text":"Virgo","details":"Virgo is the sixth sign of the zodiac, to be exact, and that's the way Virgos like it: exacting. Those born under this sign are forever the butt of jokes for being so picky and critical (and they can be), but their 'attention to detail' is for a reason: to help others. Virgos, more than any other sign, were born to serve, and it gives them great joy. They are also tailor-made for the job, since they are industrious, methodical and efficient. The sense of duty borne by these folks is considerable, and it ensures that they will always work for the greater good.

Virgo is represented by the Virgin, although this association should not be taken literally. Rather, Virgos tend to take on some of the qualities of a Virgin, things like modesty and humanity. Some might consider them repressed, although Virgins would argue that it's a noble quality, as opposed to a negative one. Most of all, Virgos enjoy indulging their practical and logical side and poring over their projects to the nth degree. To say these folks are good at fact-finding almost understates the case, since Virgos revel in their exacting (some would argue pedantic) behavior and are a whiz with minutiae. Virgins are an asset in the workplace as they can be counted on to get things right the first time, every time and no detail will be overlooked. They are also balanced and fair in their assessments in keeping with the Mutable Quality assigned to this sign.

Virgo is ruled by Mercury, and as portrayed in ancient Roman mythology, Mercury wasn't one to sit still for long. This swift-footed god was a bundle of energy, both physically and mentally, and that pretty much sums up the Virgin's makeup. A Virgo's brain is in overdrive most of the time, which is why these folks get so much done. Those born under this sign are also able communicators and use their mental acuity to maximum advantage. All of this brainpower can make Virgos prone to skepticism, and can even lead to the kind of over-think that surely leads to overkill. Thankfully, though, Virgos are also a studious lot and can temper their worst impulses with a bit of careful analysis.

The Element associated with Virgo is Earth, and in keeping with that, most Virgos are grounded, salt of the earth types. The flash and dash can go to others, since Virgos would much rather be humble and easy-going. That said, Virgins do enjoy material possessions and are (dare we say?) picky about what they bring into their lives. Some might even go as far as calling them self-centered, but it's really more of a desire to surround themselves with what's right for them. This knack for discernment also serves Virgos well in business, where their decisions are usually dead-on.

Working out is elemental for Virgo, if only so they know intellectually that they're helping themselves physically. See, the benefits of exercise are far more important to Virgo than the process itself. That's why Virgos are likely to time themselves on their runs and get in those 300 sit-ups every day. When it comes to the game of love, Virgos are able to loosen up somewhat and are devoted to their lovers, even if they can be a bit jealous. Since Virgo rules the intestines, worried Virgos need to be wary of bowel upsets. Soothing relief often comes in the way of earth tones, which is why Virgos like to be surrounded by shades of tan and a warm yellow.

The great strength of the Virgo-born is in their practicality, sharp mind and attention to detail. When merged with their willingness to serve, Virgos become essential helpmates. They can be picky so what?	","thumb":"asset:///images/thumb/Virgo.jpg","image":"asset:///images/details/Virgo.jpg"},
{"text":"Leo","details":"Leo is the fifth sign of the zodiac. These folks are impossible to miss, since they love being center stage. Making an impression is Job One for Leos, and when you consider their personal magnetism, you see the job is quite easy. Leos are an ambitious lot, and their strength of purpose allows them to accomplish a great deal. The fact that these folks are also creative makes their endeavors fun for them and everyone else. It's quite common to see a Leo on stage or in Hollywood, since these folks never shy away from the limelight. They are also supremely talented and have a flair for the dramatic. Warmth and enthusiasm seems to seep from every Leo pore, making these folks a pleasure to be around. They do love pleasure!

It's the Lion that symbolizes Leos, and the king (or queen) of the jungle is a most appropriate mascot, since they consider themselves the rulers of their universe (and the zodiac at that). Like Lions, Leos tend to be dignified and strong, and it is this sense of their power that allows them to get things done. A Leo on your team is a good thing, since Lions are eager to see their projects through to completion. Putting these folks at the helm is a good thing, too, since the Leo-born are natural leaders. They may ruffle a few feathers along the way, however, since they can also be overbearing and somewhat autocratic. This may be in keeping with the Fixed Quality assigned to this sign Lions are indeed opinionated and set in their ways. That said, they are well organized, idealistic and have a knack for inspiring others.

Leo is ruled by the Sun the center of the universe and the fuel for our being. In much the same way, Leos consider themselves indispensable and the center of the universe, and those who would tell them otherwise had better look out! Lions are outgoing, self-assured and have a tremendous zest for life. 

The element associated with Leo is Fire. Everything about the Lion's personality is hot, hot, hot. Those born under this sign are fearless and strong, which may be why Lions plunge in headfirst and let the chips fall where they may. Thankfully, Leos are dignified enough not to commit too many pratfalls. It's the Lion's unswerving courage that wins so many folks over. If you need someone to lead the charge, call a Leo and the bigger the project, the better, since these folks love an expansive stage (and the audience that comes with it).

Come play time, Leos are at their best. Those born under this sign enjoy fun and games both outdoors and in (and with a group), so expect to find them playing softball, hockey or a game of cards. Lions are also a natural at the gym, where they can show their stuff to a crowd. When the lights are low, the essential Lion comes to the fore, since this beast is 90 percent fun and 100 percent romantic.

The great strengths of the Leo-born are their creativity, idealism and leadership. Lions don't lack for ambition, either, so they're likely to accomplish a lot and have fun while they're at it. Their warmth and loyalty ensures that others will enjoy the ride as well.","thumb":"asset:///images/thumb/Leo.jpg","image":"asset:///images/details/Leo.jpg"},
{"text":"Cancer","details":"Cancer, the fourth sign of the zodiac, is all about home. Those born under this sign are 'roots' kinds of people, and take great pleasure in the comforts of home and family. Cancers are maternal, domestic and love to nurture others. More than likely, their family will be large, too -- the more, the merrier! Cancers will certainly be merry if their home life is serene and harmonious. Traditions are upheld with great zest in a Cancer's household, since these folks prize family history and love communal activities. They also tend to be patriotic, waving the flag whenever possible. A Cancer's good memory is the basis for stories told around the dinner table, and don't be surprised if these folks get emotional about things. Those born under this sign wear their heart on their sleeve, which is just fine by them.

The mascot of Cancer is the Crab, and much like this shelled little critter, Cancers are quick to retreat into their shells if it suits their mood. No wonder these folks are called crabby! For Cancer, it's not that big of a deal, though, since they consider this 'shell' a second home (and they do love home). The flip side of this hiding is that shell-bound Crabs are often quite moody.

Cancers are ruled by the Moon the Great Mother of the heavens in ancient times. Here on Earth, this is manifested in the Crab's maternal instincts and desire to protect home and hearth.

The element associated with Cancer is Water. Like the rolling waves of the sea, the Crab's emotions can make quite a splash. These folks tend to pick up on things and bring them in, with the outward result ranging from sentimentality to possessiveness. Crabs need to resist the temptation to become selfish or to feel sorry for themselves, since this behavior won't help. On the bright side, Cancers are good with money (although some consider them too thrifty), probably because they value a sense of security. Crabs are also quick to help others and tend to avoid confrontation. In keeping with their nurturing bent, those born under this sign are a whiz with food. A hearty picnic in the park is heaven-on-earth to most Crabs.

Cancers often find that a robust workout session is just the tonic for their touchy feelings. Team sports are always nice, since they offer a sense of community; water polo should be elemental to aquatic Crabs. What are their team colors? The Moon is silver and white. Since Cancers have a tendency to be lazy, however, they may need someone to push them out the door. When it comes to the game of love, eager Crabs are devoted, romantic and able to get things going on their own. Crabs are wise to listen to their gut, since this sign rules the stomach.

The great strength of the Cancer-born is the tenacity with which they protect their loved ones. These folks don't ask for much, either: a comfortable home and sense of peace about sums it up. It's that nurturing instinct which makes Cancers a pleasure to be with.","thumb":"asset:///images/thumb/Cancer.jpg","image":"asset:///images/details/Cancer.jpg"},
{"text":"Gemini","details":"Gemini is the third sign of the zodiac, and those born under this sign will be quick to tell you all about it. That's because they love to talk! It's not just idle chatter with these folks, either. The driving force behind a Gemini's conversation is their mind. The Gemini-born are intellectually inclined, forever probing people and places in search of information. Dalliances with these folks are always enjoyable, since Geminis are bright, quick-witted and the proverbial life of the party. Even though their intellectual minds can rationalize forever and a day, Geminis also have a surplus of imagination waiting to be tapped. Can a Gemini be boring? Never!

Since Geminis are a mix of the yin and the yang, they are represented perfectly by the Twins. The Gemini-born can easily see both sides of an issue, a wonderfully practical quality. Less practical is the fact that you're not sure which Twin will show up half the time. Geminis may not know who's showing up either, which can prompt others to consider them fickle and restless.

They can be wishy-washy, too, changing their mood on a simple whim. It's this characteristic which readily suggests the Mutable Quality assigned to this sign. Mutable folks are flexible and go with the flow. Further, the Twins are adaptable and dexterous and can tackle many things at once. It's a good thing, too, when you consider their myriad interests. The downside of such a curious mind, however, can be a lack of follow-through. How much can any one person do, anyway?

Ruled by Mercury, Geminis exhibit a delicious brand of mercurial energy. They are quick-thinking, quick-witted and fast on their feet, much like the messenger god of Roman mythology that rules their sign. Geminis are both curious and clever, which is why they are such a hit at cocktail parties.

The element associated with Gemini is Air. Air signs are the thinking person's signs, and the Twins don't disappoint. Those born under this sign prize intellect and consider it the key to all things. At work, they are the clearest of thinkers, looking at a project from all (well, at least two) sides and putting forth some logical and well-thought-out ideas. This quality makes Geminis an asset to any team, and while these folks are not inclined to take the lead, they are a most valuable component.

When it comes to sports, Geminis would seem a natural for doubles tennis and they are. They love the camaraderie of games and play, which is why they excel at team events. Whether it's volleyball or a game of charades, Geminis are always ready to play. A book club would certainly stimulate their literary minds. In the game of love, Geminis are playful, flirtatious and endless fun.

The great strength of the Gemini-born is in their ability to communicate effectively and to think clearly. Adventures of the mind are what the Twins are all about. They also love to share themselves with their friends, and they make for charming companions.","thumb":"asset:///images/thumb/Gemini.jpg","image":"asset:///images/details/Gemini.jpg"},
{"text":"Taurus","details":"Taurus, the second sign of the zodiac, is all about reward. Unlike the Aries love of the game, Taurus loves the rewards of the game. Think physical pleasures and material goods, for those born under this sign revel in delicious excess. They are also a tactile lot, enjoying a tender, even sensual, touch. Taurus adores comfort and likes being surrounded by pleasing, soothing things. Along these lines, they also favor a good meal and a fine wine. The good life in all its guises, whether it's the arts or art of their own making (yes, these folks are artistic as well), is heaven on Earth to the Taurus-born.

It's the Bull that serves as the Taurus's mascot, and along with that comes the expectation that these folks are bull-headed and stubborn. Yes, they are. Hey, this sign has a Fixed Quality attached to it after all, so expect that things will occasionally grind to a halt. That said, Taurus does not start out with the intention of getting stuck. They simply want to get things done, and it's that steady, dogged persistence that winds up being viewed as stubbornness. Bulls are actually among the most practical and reliable members of the zodiac, and they are happy to plod along, as it were, in pursuit of their goals. The good news for Bulls is that once they get to the finish line, they'll swaddle themselves in material goods. A self-indulgent beast? Perhaps, but if you toiled as laboriously as these folks do, you'd need some goodies, too.

Taurus is ruled by Venus, a lovely goddess who didn't deny herself many things. In ancient Roman mythology, Venus was the Goddess of Love, Beauty and Pleasure, and Taurus has pretty much taken up where she left off. Bulls are fond of all things pretty, whether it's in their home, at a museum or on the stage.

Taurus values harmony in their personal lives, so they'll work hard on keeping their mate happy. The Bull's penchant for sensual pleasures, of course, can only help things along! Bulls can also be the sappiest of sentimentalists. Will all this overweening attention to their mate turn a Bull into a possessive mess? Probably not, although these folks do have to manage their tendency to latch on a bit tight. At the end of the day, however, Taurus's are true romantics and loyal to the core.

The Element associated with Taurus is Earth. No pie-in-the-sky for these practical folks, since they'd much rather be on terra firma. Bulls tend toward conservatism, and this is often seen in their day-to-day behavior. No far-out schemes (that's Air) or shrieking ultimatums (more like Fire) here. Taurus much prefers to take each day slowly and steadily and work toward their ultimate goal. Along these lines, those born under this sign are happy to stick with their projects until they have reached a successful conclusion. They are also extremely patient and dependable along the way. Does that sound earthy enough? 

Seeing as how Bulls are generally strong and well-built, it's no surprise that these folks enjoy testing their strength on the field of play. Expect to find a Bull engaged in a spirited game of hoops or mountain climbing. When it comes to love, the Taurus-born are devoted, romantic and somewhat possessive. Their sensual nature has a way of erasing any mistakes! Since Taurus rules the neck and throat, Bulls would be wise to keep a silky scarf at hand, ideally in a warm (and soothing) earth tone.

The great strength of Taurus is in their stability, loyalty and dogged determination. Bulls want to get the job done, and they will. What better way to get the riches they so fervently crave?","thumb":"asset:///images/thumb/Taurus.jpg","image":"asset:///images/details/Taurus.jpg"},
{"text":"Aries","details":"Aries is the first sign of the zodiac, and that's pretty much how those born under this sign see themselves: first. Aries are the leaders of the pack, first in line to get things going. Whether or not everything gets done is another question altogether, for an Aries prefers to initiate rather than to complete. Do you have a project needing a kick-start? Call an Aries, by all means. The leadership displayed by Aries is most impressive, so don't be surprised if they can rally the troops against seemingly insurmountable odds they have that kind of personal magnetism. An Aries won't shy away from new ground, either. Those born under this sign are often called the pioneers of the zodiac, and it's their fearless trek into the unknown that often wins the day. Aries is a bundle of energy and dynamism, kind of like a Pied Piper, leading people along with its charm and charisma. The dawning of a new day and all of its possibilities is pure bliss to an Aries.

The symbol of Aries is the Ram, and that's both good and bad news. Impulsive Aries might be tempted to ram their ideas down everyone's throats without even bothering to ask if they want to know. It's these times when you may wish Aries' symbol were a more subdued creature, more lamb than ram perhaps. You're not likely to convince the Ram to soften up; these folks are blunt and to the point. Along with those qualities comes the sheer force of the Aries nature, a force that can actually accomplish a great deal. Much of Aries' drive to compete and to win comes from its Cardinal Quality. Cardinal Signs love to get things going, and Aries exemplifies this even better than Cancer, Libra or Capricorn.

Aries is ruled by Mars. Taking a peek at Roman mythology, we find that Mars was the God of War. Our man Mars was unafraid to do battle, and much the same can be said for Aries. These folks are bold, aggressive and courageous.

The element associated with Aries is Fire. Think action, enthusiasm and a burning desire to play the game. Aries love physicality, so they won't sit on the sidelines for long, if at all. They'll jump into the fray full force and will contribute much in the process. Talk about eager beavers! Sure, some of their decisions may later prove to have been hasty, but you'll never find an Aries who regretted taking a shot.

Making things happen is what it's all about to these folks. Aries are also unafraid of stepping onto new terrain. The challenge inherent in taking on the unknown is heaven on Earth for Rams. Sure, they may appear arrogant when they take on the world, but they'll be quick to tell you it's the only way to go. 

Aries plays as hard as they work. These folks are happiest in a spirited soccer match or engaging in the martial arts. In the game of love, the Ram's ardor is unquestioned, although Aries can also be playful and romantic with their mate.

The great strength of the Aries-born is in their initiative, courage and determination. These folks love to get things going and are fearless along the way. Their dynamism and competitive spirit add considerably to any of their endeavors.","thumb":"asset:///images/thumb/Aries.jpg","image":"asset:///images/details/Aries.jpg"}
]